---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCOpeningData.GetOpeningSolids
source: html/5e3d0561-cd2d-ed30-8b25-1334df406d47.htm
---
# Autodesk.Revit.DB.IFC.IFCOpeningData.GetOpeningSolids Method

Gets opening solids.

## Syntax (C#)
```csharp
public IList<Solid> GetOpeningSolids()
```

## Returns
The solids.